In [2]:
# This notebook is just to explore the data.
# the main application code is in the python file

In [1]:
import pandas as pd
import numpy as np

In [4]:
df =pd.read_csv('chicago.csv')

In [5]:
data.head()

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year
0,1423854,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0
1,955915,2017-05-25 18:19:03,2017-05-25 18:45:53,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0
2,9031,2017-01-04 08:27:49,2017-01-04 08:34:45,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0
3,304487,2017-03-06 13:49:38,2017-03-06 13:55:28,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0
4,45207,2017-01-17 14:53:07,2017-01-17 15:02:01,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0

In [6]:
data.columns

Index(['Unnamed: 0', 'Start Time', 'End Time', 'Trip Duration',
       'Start Station', 'End Station', 'User Type', 'Gender', 'Birth Year'],
      dtype='object')

In [7]:
data.describe()

         Unnamed: 0  Trip Duration     Birth Year
count  3.000000e+05  300000.000000  238981.000000
mean   7.763458e+05     936.239290    1980.858223
std    4.481464e+05    1548.792767      11.003329
min    4.000000e+00      60.000000    1899.000000
25%    3.871368e+05     393.000000    1975.000000
50%    7.771035e+05     670.000000    1984.000000
75%    1.164065e+06    1125.000000    1989.000000
max    1.551500e+06   86224.000000    2016.000000

In [126]:
data['Start Time'] = pd.to_datetime(data['Start Time'])
start_time = data['Start Time']
start_time.describe()

count                  300000
unique                 292758
top       2017-05-15 13:13:00
freq                        4
first     2017-01-01 00:07:57
last      2017-06-30 23:59:01
Name: Start Time, dtype: object

In [9]:
# get the most frequent Month
months = start_time.dt.month
months.median()

5.0

In [10]:
# get the most frequent day of the week
# The day of the week with Monday=0, Sunday=6
days = start_time.dt.weekday
days.median()

3.0

In [11]:
# get the most common start hour
hours = start_time.dt.hour
hours.median()

14.0

In [127]:
#filter data by month
data[data['Start Time'].dt.month == 1]

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year,routes
2,9031,2017-01-04 08:27:49,2017-01-04 08:34:45,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0,from May St & Taylor Stto Wood St & Taylor St
4,45207,2017-01-17 14:53:07,2017-01-17 15:02:01,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0,from Clark St & Randolph Stto Desplaines St & ...
7,65924,2017-01-21 14:28:38,2017-01-21 14:40:41,723,Larrabee St & Kingsbury St,Larrabee St & Armitage Ave,Customer,NaN,NaN,from Larrabee St & Kingsbury Stto Larrabee St ...
11,71678,2017-01-22 15:15:45,2017-01-22 15:31:02,917,Southport Ave & Wellington Ave,Clark St & Schiller St,Subscriber,Male,1964.0,from Southport Ave & Wellington Aveto Clark St...
12,19061,2017-01-08 16:03:00,2017-01-08 16:07:37,277,Green St & Madison St,Ada St & Washington Blvd,Subscriber,Male,1961.0,from Green St & Madison Stto Ada St & Washingt...
...,...,...,...,...,...,...,...,...,...,...
299958,108699,2017-01-31 11:44:34,2017-01-31 11:52:17,463,Indiana Ave & Roosevelt Rd,Michigan Ave & Madison St,Subscriber,Female,1966.0,from Indiana Ave & Roosevelt Rdto Michigan Ave...
299972,44015,2017-01-17 08:42:37,2017-01-17 08:53:20,643,Racine Ave & Wrightwood Ave,Clark St & Wellington Ave,Subscriber,Female,1978.0,from Racine Ave & Wrightwood Aveto Clark St & ...
299975,49643,2017-01-18 11:28:36,2017-01-18 11:31:14,158,Dayton St & North Ave,Sheffield Ave & Kingsbury St,Subscriber,Male,1958.0,from Dayton St & North Aveto Sheffield Ave & K...
299993,68299,2017-01-21 17:16:02,2017-01-21 17:55:11,2349,Lake Shore Dr & Monroe St,McClurg Ct & Erie St,Customer,NaN,NaN,from Lake Shore Dr & Monroe Stto McClurg Ct & ...
299995,64825,2017-01-21 13:18:00,2017-01-21 13:27:50,590,Orleans St & Elm St (*),Sheffield Ave & Webster Ave,Subscriber,Male,1965.0,from Orleans St & Elm St (*)to Sheffield Ave &...

In [50]:
#most commonly used start station
most_start_station = data['Start Station'].value_counts().keys()[0]
most_start_station

'Streeter Dr & Grand Ave'

In [59]:
# combine start and end trip
data['routes']= 'from ' + data['Start Station'] + ' to ' + data['End Station']
data['routes'].value_counts().keys()[0]

'from Lake Shore Dr & Monroe Stto Streeter Dr & Grand Ave'

In [67]:
# Calculate total travel time
data['Trip Duration'].mean()

float

In [68]:
#Calculate Total travel time
data['Trip Duration'].sum()

numpy.int64

In [138]:
# get user types
data['User Type'].value_counts().size

3

In [89]:
#get user Gender
data['Gender'].value_counts()

2

In [136]:
# Display earliest, most recent, and most common year of birth
year_of_birth = data['Birth Year'].dropna().astype(int)
year_of_birth.median()

1984.0